cases/openfoam.org/solarChimney/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    glass
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    heaterTop
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    heaterSides
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    side
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    chimney
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
}


// ************************************************************************* //
